IDEA Open Model
PointResultBase Class
Compatible with IDEA StatiCa Beta 20.0
 Point Result Base abstract class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.PointResultBase
 IdeaRS.OpenModel.Result.PointResultOfNLA
 IdeaRS.OpenModel.Result.PointResultOfTA
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class PointResultBase
Public MustInherit Class PointResultBase
The PointResultBase type exposes the following members.
Constructors
Name | Description
PointResultBase
Initializes a new instance of the PointResultBase class
Top
Properties
Name | Description
Loading
 Loading
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace